Repository: dsirotkin/MultiLang_ASPNET_MVC_cv
Catalog: MultiLangCV/App_GlobalResources/CV.*.resx
Languages: ru, uk

# mw_1_exp_company
source: <a href="http://www.pharmplanet.com.ua" target="_blank">Pharmplanet. Kyiv, Ukraine.</a>
ru: <a href="http://www.pharmplanet.com.ua" target="_blank">Pharmplanet. Киев, Украина.</a>
uk: <a href="http://www.pharmplanet.com.ua" target="_blank">Pharmplanet. Київ, Україна.</a>

# mw_1_exp_pos
source: Software support specialist
ru: Специалист технической поддержки
uk: Спеціаліст служби підтримки

# mw_1_exp_resp
source: <p>Responsibility:</p> <p>- Bug fixing in stored procedures (Firebird).</p> <p>- Creating and tuning reports.</p>
ru: <p>Обязанности:</p> <p>- Исправление ошибок в хранимых процедурах (Firebird).</p> <p>- Создание и настройка отчетов.</p>
uk: <P> Обов'язки: </ p> <P> - Виправлення помилок в збережених процедурах (Firebird). </ P> <P> - Створення та налагодження звітів. </ P>

# mw_1_exp_time
source: November 2011 - June 2012 (8 month’s)
ru: Ноябрь 2011 - Июнь 2012 (8 месяцев)
uk: Листопад 2011 - Червень 2012 (8 місяців)

# mw_2_exp_company
source: <a href="http://fleettech.com.ua/" target="_blank">Fleettech. Kyiv, Ukraine.</a>
ru: <a href="http://fleettech.com.ua/" target="_blank">Fleettech. Киев, Украина.</a>
uk: <a href="http://fleettech.com.ua/" target="_blank">Fleettech. Київ, Україна.</a>

# mw_2_exp_pos
source: Backend developer
ru: Backend программист
uk: Backend програміст

# mw_2_exp_resp
source: <p>Responsibility:</p> <p>- Analyzing user requirements</p> <p>- Developing physical and logical data models and implements data architectures.</p> <p>- Creating stored procedures, Triggers, Views, Functions.</p> <p>- Development of analytical reports.</p> <p>- Migrate data into new database from Firebird and Excell.</p> <p>- Business process automation using stored procedures and Jobs.</p> <p>- Writing WebAPI controllers using Entity Framework.</p>
ru: <p>Обязанности:</p> <p>- Анализ требований пользователя</p> <p>- Разработка физических и логических моделей данных</p> <p> - Создание хранимых процедур, триггеров, представлений, функций. </ p> <p> - Разработка аналитических отчетов. </ p> <p> - Перенос данных в новую базу данных из БД Firebird и Excell. </ p> <p> - автоматизация бизнес-процессов с использованием хранимых процедур и MS SQL Jobs. </ p> <p> - Написание контроллеров WebAPI с использованием Entity Framework. </ p>
uk: <p> Обов'язки: </p> <br> - Аналіз вимог користувача </br> <br> - Розробка фізичних і логічних моделей даних </br> <br> - Створення збережених процедур, тригерів, уявлень, функцій. </br> <br> - Розробка аналітичних звітів. </br> <br> - Перенесення даних в нову базу даних з БД Firebird і Excell. </br> <br> - автоматизація бізнес-процесів з використанням збережених процедур і MS SQL Jobs. </br> <br> - Написання контролерів WebAPI з використанням Entity Framework. </br>

# mw_2_exp_time
source: June 2012 - July 2017 (5 years)
ru: Июнь 2012 - Июль 2017 (5 лет)
uk: Липень 2012 - Червень 2017 (5 років)

# mw_3_exp_company
source: <a href="https://www.luckylandgaming.com/" target="_blank">Lacky land gaming. Kyiv, Ukraine.</a>
ru: <a href="https://www.luckylandgaming.com/" target="_blank">Lacky land gaming. Киев, Украина.</a>
uk: <a href="https://www.luckylandgaming.com/" target="_blank">Lacky land gaming. Київ, Україна.</a>

# mw_3_exp_pos
source: T-SQL developer
ru: T-SQL программист
uk: T-SQL програміст

# mw_3_exp_resp
source: <p>Responsibility:</p> <p>- Development of a new normalized table structure. Normalization of already existing tables.</p> <p>- Creating stored procedures, Triggers, Views, Functions for new functionality.</p> <p>- Creating and maintaining SQL Server Jobs</p> <p>- Database tuning. Manage indexes and optimizing queries.</p> <p>- Manage DDL triggers.</p> <p>- Cross database data migration.</p>
ru: <p>Обязанности:</p> <p> - Разработка новой нормализованной структуры данных. Нормализация уже существующих таблиц. </ P> <p> - Создание хранимых процедур, триггеров, представлений, функций для нового функционала</ p> <p> - Создание и поддержка SQL Server Jobs </ p> <p> - Настройка базы данных. Управление индексами и оптимизация запросов. </ P> <p> - Написание и управление триггерами DDL. </ p> <p>- Настройка бмена данными между БД.</p>
uk: <p> Обов'язки: </p> <p> - Розробка нової нормализованной структури даних. Нормалізація вже існуючих таблиць. </p> <p> - Створення збережених процедур, тригерів, уявлень, функцій для нового функціоналу </p> <p> - Створення та підтримка SQL Server Jobs </p> <p> - Налаштування бази даних. Управління індексами і оптимізація запитів. </p> <p> - Написання і управління тригерами DDL. </p> <p> - Налаштування бміну даними між БД. </p>

# mw_3_exp_time
source: July 2017 - present time
ru: Июль 2017 - настоящее время
uk: Липень 2017 - теперішній час

# mw_add
source: Additional information
ru: Дополнительная информация
uk: Додаткова інформація

# mw_add_info
source: <p>As SQL Developer, I have a good practice of development database schema. I used memory-optimized tables, worked with JSON and XML in SQL. I worked with new project where all business - logic was in SQL. Also I have experience with high-loaded databases (tables more than 10GB). Participated in the project as a software architect. Were developed by me stored procedures for complex mathematical calculations, search in all string values in DB, Database DDL logger. </p> <p>I have analytical skills, which I used to design business processes in software and their further implementation. I constantly monitor new capabilities of development tools and apply them in my work.</p> <p>I wish to develop my skills in the field of programming, I do not dwell on the achieved. I can work in a team. Have strong knowledge in OOP and WEB development. One of my qualities is the ability to quickly learn new products and technologies. Endowed with creative possibilities. There is a desire to work and earn.</p>
ru: <p> Как разработчик SQL, у меня есть хорошая практика разработки схемы базы данных. Я использовал оптимизированные для памяти таблицы, работал с JSON и XML в SQL. Я работал с новым проектом, где вся бизнес-логика была в SQL. Также у меня есть опыт работы с высоконагруженными базами данных (таблицы более 10 ГБ). Участвовал в проекте как архитектор программного обеспечения. Были разработаны мной хранимые процедуры для сложных математических вычислений, поиск во всех строковых значениях в DB, ​​DDL logger. </ Р> <p> У меня есть аналитические навыки, которые я использовал для разработки бизнес-процессов в программном обеспечении и их дальнейшей реализации. Я постоянно отслеживаю новые возможности инструментов разработки и применяю их в своей работе. </ P> <p> Я хочу развивать свои навыки в области программирования, я не останавливаюсь на достигнутом. Умею работать в команде. Обладаю знаниями в области ООП и WEB разработки. Одним из моих качеств является способность быстро изучать новые продукты и технологии. Наделен творческими возможностями. Есть желание работать и зарабатывать. </p>
uk: <P> Як розробник SQL, у мене є хороша практика розробки схеми бази даних. Я використовував оптимізовані для пам'яті таблиці, працював з JSON і XML в SQL. Я працював з новим проектом, де вся бізнес-логіка була в SQL. Також у мене є досвід роботи з високонавантажених базами даних (таблиці більше 10 ГБ). Брав участь в проекті як архітектор програмного забезпечення. Були розроблені мною збережені процедури для складних математичних обчислень, пошук у всіх строкових значеннях в DB, ​​DDL logger. </ Р> <P> У мене є аналітичні навички, які я використовував для розробки бізнес-процесів в програмному забезпеченні і їх подальшої реалізації. Я постійно відстежую нові можливості інструментів розробки і застосовую їх в своїй роботі. </ P> <P> Я хочу розвивати свої навички в області програмування, я не зупиняюся на досягнутому. Вмію працювати в команді. Маю знання в області ООП і WEB програмування. Однією з моїх якостей є здатність швидко вивчати нові продукти і технології. Наділений творчими можливостями. Є бажання працювати і заробляти. </ P>

# mw_education
source: Education
ru: Образование
uk: Освіта

# mw_edu_1_name
source: National Aviation University
ru: Национальный авиационный университет
uk: Національний авіаційний універсітет

# mw_edu_1_place
source: Kyiv, Ukraine
ru: Киев, Украина
uk: Київ, Україна

# mw_edu_1_rank
source: Software Engineering, Bachelor
ru: Программная инженерия, Бакалавр
uk: Програмна інженерія, Бакалавр

# mw_edu_1_time
source: Finish year 2016
ru: Год окончания 2016
uk: Рік закінчення 2016

# mw_edu_2_name
source: Olexandrian Polytechnic College
ru: Александрийский политехнический университет
uk: Олександрійський політехнічний коледж

# mw_edu_2_place
source: Olexandria, Ukraine
ru: Александрия, Украина
uk: Олександрія, Україна

# mw_edu_2_rank
source: Software Engineering, junior specialist
ru: Программная инженерия, младший специалист
uk: Програмна інженерія, молодший спеціаліст

# mw_edu_2_time
source: Finish year 2009
ru: Год окончания 2009
uk: Рік закінчення 2009

# mw_experiences
source: Experiences
ru: Опыт работы
uk: Досвід роботи

# mw_laguages
source: Language proficiency
ru: Знание языков
uk: Знання мов

# mw_lang_en
source: <b>English</b> - intermediate
ru: <b>Английский</b> - средний уровень
uk: <b>Англійська</b> - середній рівень

# mw_lang_ru
source: <b>Ukrainian</b> - fluent
ru: <b>Украинский</b> - родной
uk: <b>Українська</b> - рідна

# mw_lang_ua
source: <b>Russian</b> - fluent
ru: <b>Русский</b> - родной
uk: <b>Російська</b> - рідна

# sb_contacts
source: Contacts
ru: Контакты
uk: Контакти

# sb_dob
source: Date of birth
ru: Дата рождения
uk: Дата народження

# sb_name
source: Sirotkin Dmytro
ru: Сиротикн Дмитирий
uk: Сіроткін Дмитро

# sb_other
source: Other
ru: Другое
uk: Інше

# sb_position
source: T-SQL developer
ru: T-SQL программист
uk: T-SQL програміст

# sb_region
source: Region
ru: Регион
uk: Регіон

# sb_region_name
source: Kyiv
ru: Киев
uk: Київ

# mw_skills_title
source: Skills & Proficiency
ru: Навыки и умения
uk: Навички та вміння
